Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
            - Comment = "partition by kind"
                                      - Name    = "kind"
                                      - Type    = "string"
                                    },
                                ]
                              - StorageDescriptor = {
                                  - Columns      = [
                                      - {
                                          - Name = "term"
                                          - Type = "string"
                                        },
                                      - {
                                          - Name = "label"
                                          - Type = "string"
                                        },
                                      - {
                                          - Name = "type"
                                          - Type = "string"
                                        },
                                      - {
                                          - Name = "_projectname"
                                          - Type = "string"
                                        },
                                    ]
                                  - InputFormat  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
                                  - Location     = "s3://gaspi-metadata-20250725085316769800000002/terms"
                                  - OutputFormat = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"
                                  - SerdeInfo    = {
                                      - Name                 = "ORC"
                                      - Parameters           = {
                                          - "hive.orc.use-column-names" = "TRUE"
                                          - "orc.column.index.access"   = "FALSE"
                                          - "serialization.format"      = "1"
                                        }
                                      - SerializationLibrary = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
                                    }
                                }
                              - TableType         = "EXTERNAL_TABLE"
                            }
                        }
                      - Type       = "AWS::Glue::Table"
                    }
                }
            }
        ) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.aws_dynamodb_table.anscestor_terms will be updated in-place
  ~ resource "aws_dynamodb_table" "anscestor_terms" {
        id                          = "sbeacon-Anscestors"
        name                        = "sbeacon-Anscestors"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.clinic_jobs will be updated in-place
  ~ resource "aws_dynamodb_table" "clinic_jobs" {
        id                          = "sbeacon-dataportal-clinic-jobs"
        name                        = "sbeacon-dataportal-clinic-jobs"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.clinical_annotations will be updated in-place
  ~ resource "aws_dynamodb_table" "clinical_annotations" {
        id                          = "sbeacon-dataportal-clinical-annotations"
        name                        = "sbeacon-dataportal-clinical-annotations"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.clinical_variants will be updated in-place
  ~ resource "aws_dynamodb_table" "clinical_variants" {
        id                          = "sbeacon-dataportal-clinical-variants"
        name                        = "sbeacon-dataportal-clinical-variants"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.dataportal_locks_table will be updated in-place
  ~ resource "aws_dynamodb_table" "dataportal_locks_table" {
        id                          = "sbeacon-dataportal-mutex-locks"
        name                        = "sbeacon-dataportal-mutex-locks"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.dataportal_pricing_cache will be updated in-place
  ~ resource "aws_dynamodb_table" "dataportal_pricing_cache" {
        id                          = "sbeacon-dataportal-pricing-cache"
        name                        = "sbeacon-dataportal-pricing-cache"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.descendant_terms will be updated in-place
  ~ resource "aws_dynamodb_table" "descendant_terms" {
        id                          = "sbeacon-Descendants"
        name                        = "sbeacon-Descendants"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.juptyer_notebooks will be updated in-place
  ~ resource "aws_dynamodb_table" "juptyer_notebooks" {
        id                          = "sbeacon-dataportal-juptyer-notebooks"
        name                        = "sbeacon-dataportal-juptyer-notebooks"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.ontologies will be updated in-place
  ~ resource "aws_dynamodb_table" "ontologies" {
        id                          = "sbeacon-Ontologies"
        name                        = "sbeacon-Ontologies"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.project_users will be updated in-place
  ~ resource "aws_dynamodb_table" "project_users" {
        id                          = "sbeacon-dataportal-project-users"
        name                        = "sbeacon-dataportal-project-users"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.projects will be updated in-place
  ~ resource "aws_dynamodb_table" "projects" {
        id                          = "sbeacon-dataportal-projects"
        name                        = "sbeacon-dataportal-projects"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.saved_queries will be updated in-place
  ~ resource "aws_dynamodb_table" "saved_queries" {
        id                          = "sbeacon-dataportal-saved-queries"
        name                        = "sbeacon-dataportal-saved-queries"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.sbeacon_dataportal_users_info will be updated in-place
  ~ resource "aws_dynamodb_table" "sbeacon_dataportal_users_info" {
        id                          = "sbeacon-dataportal-users-info"
        name                        = "sbeacon-dataportal-users-info"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.vcfs will be updated in-place
  ~ resource "aws_dynamodb_table" "vcfs" {
        id                          = "sbeacon-vcfs"
        name                        = "sbeacon-vcfs"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_glue_catalog_database.metadata-database will be updated in-place
  ~ resource "aws_glue_catalog_database" "metadata-database" {
        id           = "209479276142:sbeacon_metadata"
        name         = "sbeacon_metadata"
      ~ tags         = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all     = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-analyses" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_analyses"
        name               = "sbeacon_analyses"
        # (11 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250725085316769800000002/analyses" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (14 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-analyses-cache" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_analyses_cache"
        name               = "sbeacon_analyses_cache"
        # (11 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250725085316769800000002/analyses-cache" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (14 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-biosamples" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_biosamples"
        name               = "sbeacon_biosamples"
        # (11 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250725085316769800000002/biosamples" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (23 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-biosamples-cache" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_biosamples_cache"
        name               = "sbeacon_biosamples_cache"
        # (11 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250725085316769800000002/biosamples-cache" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (23 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-datasets" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_datasets"
        name               = "sbeacon_datasets"
        # (11 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250725085316769800000002/datasets" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (15 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-datasets-cache" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_datasets_cache"
        name               = "sbeacon_datasets_cache"
        # (11 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250725085316769800000002/datasets-cache" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (15 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-individuals" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_individuals"
        name               = "sbeacon_individuals"
        # (11 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250725085316769800000002/individuals" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (16 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-individuals-cache" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_individuals_cache"
        name               = "sbeacon_individuals_cache"
        # (11 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250725085316769800000002/individuals-cache" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (16 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-relations will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-relations" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_relations"
        name               = "sbeacon_relations"
        # (11 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250725085316769800000002/relations" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (6 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-runs" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_runs"
        name               = "sbeacon_runs"
        # (11 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250725085316769800000002/runs" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (14 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-runs-cache" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_runs_cache"
        name               = "sbeacon_runs_cache"
        # (11 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250725085316769800000002/runs-cache" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (14 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-terms-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-terms-cache" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_terms_cache"
        name               = "sbeacon_terms_cache"
        # (11 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250725085316769800000002/terms-cache" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (7 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_crawler.sbeacon-crawler will be updated in-place
  ~ resource "aws_glue_crawler" "sbeacon-crawler" {
        id                     = "sbeacon-crawler"
        name                   = "sbeacon-crawler"
      ~ tags                   = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all               = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (10 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.aws_iam_instance_profile.ec2_deidentification_instance_profile will be updated in-place
  ~ resource "aws_iam_instance_profile" "ec2_deidentification_instance_profile" {
        id          = "sbeacon_backend_ec2_deidentification_instance_profile"
        name        = "sbeacon_backend_ec2_deidentification_instance_profile"
      ~ tags        = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_policy.extra-glue-policy will be updated in-place
  ~ resource "aws_iam_policy" "extra-glue-policy" {
        id               = "arn:aws:iam::209479276142:policy/extra-glue-policy"
        name             = "extra-glue-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:ListAllMyBuckets",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:GetBucketAcl",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250725085316769800000002/*",
                          - "arn:aws:s3:::gaspi-metadata-20250725085316769800000002",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags             = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all         = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_role.ec2_deidentification_instance_role will be updated in-place
  ~ resource "aws_iam_role" "ec2_deidentification_instance_role" {
        id                    = "sbeacon_backend_ec2_deidentification_instance_role"
        name                  = "sbeacon_backend_ec2_deidentification_instance_role"
      ~ tags                  = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_iam_role.glue_role will be updated in-place
  ~ resource "aws_iam_role" "glue_role" {
        id                    = "glue_role"
        name                  = "glue_role"
      ~ tags                  = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_role.sagemaker_jupyter_instance_role will be updated in-place
  ~ resource "aws_iam_role" "sagemaker_jupyter_instance_role" {
        id                    = "sbeacon_backend_sagemaker_jupyter_instance_role"
        name                  = "sbeacon_backend_sagemaker_jupyter_instance_role"
      ~ tags                  = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_role_policy.ec2_deidentification_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "ec2_deidentification_policy" {
        id          = "sbeacon_backend_ec2_deidentification_instance_role:sbeacon_backend_ec2_deidentification_policy"
        name        = "sbeacon_backend_ec2_deidentification_policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*/project-files/*",
                                  - "staging/projects/*/project-files/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal-20250725085318492000000003"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250725085318492000000003/staging/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250725085318492000000003/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "dynamodb:UpdateItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-vcfs",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-projects",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.aws_kms_alias.pii_encryption_key will be destroyed
  # (because aws_kms_alias.pii_encryption_key is not in configuration)
  - resource "aws_kms_alias" "pii_encryption_key" {
      - arn            = "arn:aws:kms:ap-southeast-3:209479276142:alias/sbeacon-dataportal-pii" -> null
      - id             = "alias/sbeacon-dataportal-pii" -> null
      - name           = "alias/sbeacon-dataportal-pii" -> null
      - region         = "ap-southeast-3" -> null
      - target_key_arn = "arn:aws:kms:ap-southeast-3:209479276142:key/5ed9009c-2b2e-45d6-a7ae-f7585461e626" -> null
      - target_key_id  = "5ed9009c-2b2e-45d6-a7ae-f7585461e626" -> null
        # (1 unchanged attribute hidden)
    }

  # module.sbeacon.aws_kms_key.pii_encryption_key will be destroyed
  # (because aws_kms_key.pii_encryption_key is not in configuration)
  - resource "aws_kms_key" "pii_encryption_key" {
      - arn                                = "arn:aws:kms:ap-southeast-3:209479276142:key/5ed9009c-2b2e-45d6-a7ae-f7585461e626" -> null
      - bypass_policy_lockout_safety_check = false -> null
      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
      - description                        = "KMS key for PII encryption secrets" -> null
      - enable_key_rotation                = false -> null
      - id                                 = "5ed9009c-2b2e-45d6-a7ae-f7585461e626" -> null
      - is_enabled                         = true -> null
      - key_id                             = "5ed9009c-2b2e-45d6-a7ae-f7585461e626" -> null
      - key_usage                          = "ENCRYPT_DECRYPT" -> null
      - multi_region                       = false -> null
      - policy                             = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::209479276142:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Enable IAM User Permissions"
                    },
                  - {
                      - Action    = [
                          - "kms:Decrypt",
                          - "kms:DescribeKey",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::209479276142:role/sbeacon-backend-dataPortal"
                        }
                      - Resource  = "*"
                      - Sid       = "Allow Lambda access"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                             = "ap-southeast-3" -> null
      - rotation_period_in_days            = 0 -> null
      - tags                               = {
          - "Environment" = "STAGING"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "GXC"
        } -> null
      - tags_all                           = {
          - "Environment" = "STAGING"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "GXC"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:37" -> (known after apply)
      ~ code_sha256                 = "/kmrYX/vNANR54VApD1nuJwJ0OtEyTxLj0w6XqhA6Ik=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-02T09:01:16.307+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:37" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "s385WDK6MHLBxezT3cbuD3HhKj9FcpBSV8UO7H6qE48XM2GA5JbReB3rWVhQ1Ex3sAt18LMbVmLarqI3dRjdRw==" -> (known after apply) # forces replacement
      ~ source_code_size            = 18107532 -> (known after apply)
      ~ version                     = "37" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_permission.S3deidentifyFiles must be replaced
-/+ resource "aws_lambda_permission" "S3deidentifyFiles" {
      ~ id                  = "SBeaconBackendAllowS3deidentifyFilesInvoke" -> (known after apply)
      ~ source_arn          = "arn:aws:s3:::gaspi-dataportal-20250725085318492000000003" -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_permission.S3updateFiles must be replaced
-/+ resource "aws_lambda_permission" "S3updateFiles" {
      ~ id                  = "SBeaconBackendAllowS3updateFilesInvoke" -> (known after apply)
      ~ source_arn          = "arn:aws:s3:::gaspi-dataportal-20250725085318492000000003" -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket.dataportal-bucket must be replaced
+/- resource "aws_s3_bucket" "dataportal-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::gaspi-dataportal-20250725085318492000000003" -> (known after apply)
      ~ bucket                      = "gaspi-dataportal-20250725085318492000000003" -> (known after apply)
      ~ bucket_domain_name          = "gaspi-dataportal-20250725085318492000000003.s3.amazonaws.com" -> (known after apply)
      ~ bucket_prefix               = "gaspi-dataportal-" -> "gasi-dataportal-" # forces replacement
      ~ bucket_region               = "ap-southeast-3" -> (known after apply)
      ~ bucket_regional_domain_name = "gaspi-dataportal-20250725085318492000000003.s3.ap-southeast-3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z01846753K324LI26A3VV" -> (known after apply)
      ~ id                          = "gaspi-dataportal-20250725085318492000000003" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)
      - cors_rule {
          - allowed_headers = [
              - "*",
            ] -> null
          - allowed_methods = [
              - "POST",
              - "GET",
              - "HEAD",
              - "DELETE",
              - "PUT",
            ] -> null
          - allowed_origins = [
              - "*",
            ] -> null
          - expose_headers  = [
              - "x-amz-multipart-parts-count",
              - "x-amz-abort-date",
              - "ETag",
            ] -> null
          - max_age_seconds = 36000 -> null
        }

      ~ grant (known after apply)
      - grant {
          - id          = "79e4f7f1c801f322946a4da5d0aa8cd1f34f028742beb66b97023a136e7d2ea2" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "remove-zombie-staging-files" -> null
          - prefix                                 = "staging/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 3 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "expire-noncurrent-versions" -> null
          - prefix                                 = "staging/" -> null
          - tags                                   = {} -> null

          - noncurrent_version_expiration {
              - days = 1 -> null
            }
        }

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.lambda-layers-bucket must be replaced
+/- resource "aws_s3_bucket" "lambda-layers-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::gaspi-lambda-layers-20250725085312458800000001" -> (known after apply)
      ~ bucket                      = "gaspi-lambda-layers-20250725085312458800000001" -> (known after apply)
      ~ bucket_domain_name          = "gaspi-lambda-layers-20250725085312458800000001.s3.amazonaws.com" -> (known after apply)
      ~ bucket_prefix               = "gaspi-lambda-layers-" -> "gasi-lambda-layers-" # forces replacement
      ~ bucket_region               = "ap-southeast-3" -> (known after apply)
      ~ bucket_regional_domain_name = "gaspi-lambda-layers-20250725085312458800000001.s3.ap-southeast-3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z01846753K324LI26A3VV" -> (known after apply)
      ~ id                          = "gaspi-lambda-layers-20250725085312458800000001" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "79e4f7f1c801f322946a4da5d0aa8cd1f34f028742beb66b97023a136e7d2ea2" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.metadata-bucket must be replaced
+/- resource "aws_s3_bucket" "metadata-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::gaspi-metadata-20250725085316769800000002" -> (known after apply)
      ~ bucket                      = "gaspi-metadata-20250725085316769800000002" -> (known after apply)
      ~ bucket_domain_name          = "gaspi-metadata-20250725085316769800000002.s3.amazonaws.com" -> (known after apply)
      ~ bucket_prefix               = "gaspi-metadata-" -> "gasi-metadata-" # forces replacement
      ~ bucket_region               = "ap-southeast-3" -> (known after apply)
      ~ bucket_regional_domain_name = "gaspi-metadata-20250725085316769800000002.s3.ap-southeast-3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z01846753K324LI26A3VV" -> (known after apply)
      ~ id                          = "gaspi-metadata-20250725085316769800000002" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)
      - cors_rule {
          - allowed_headers = [
              - "*",
            ] -> null
          - allowed_methods = [
              - "GET",
              - "HEAD",
            ] -> null
          - allowed_origins = [
              - "*",
            ] -> null
          - expose_headers  = [] -> null
          - max_age_seconds = 3000 -> null
        }

      ~ grant (known after apply)
      - grant {
          - id          = "79e4f7f1c801f322946a4da5d0aa8cd1f34f028742beb66b97023a136e7d2ea2" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "clean-old-query-results" -> null
          - prefix                                 = "query-results/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 2 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "clean-old-cached-results" -> null
          - prefix                                 = "query-responses/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 2 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "expire-noncurrent-versions" -> null
          - tags                                   = {} -> null
            # (1 unchanged attribute hidden)

          - noncurrent_version_expiration {
              - days = 1 -> null
            }
        }

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.variants-bucket must be replaced
+/- resource "aws_s3_bucket" "variants-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::gaspi-variants-20250725085320871900000004" -> (known after apply)
      ~ bucket                      = "gaspi-variants-20250725085320871900000004" -> (known after apply)
      ~ bucket_domain_name          = "gaspi-variants-20250725085320871900000004.s3.amazonaws.com" -> (known after apply)
      ~ bucket_prefix               = "gaspi-variants-" -> "gasi-variants-" # forces replacement
      ~ bucket_region               = "ap-southeast-3" -> (known after apply)
      ~ bucket_regional_domain_name = "gaspi-variants-20250725085320871900000004.s3.ap-southeast-3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z01846753K324LI26A3VV" -> (known after apply)
      ~ id                          = "gaspi-variants-20250725085320871900000004" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "79e4f7f1c801f322946a4da5d0aa8cd1f34f028742beb66b97023a136e7d2ea2" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "clean-old-queries" -> null
          - prefix                                 = "variant-queries/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 1 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_acl.dataportal_bucket_acl must be replaced
-/+ resource "aws_s3_bucket_acl" "dataportal_bucket_acl" {
      ~ bucket                = "gaspi-dataportal-20250725085318492000000003" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-dataportal-20250725085318492000000003,private" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "79e4f7f1c801f322946a4da5d0aa8cd1f34f028742beb66b97023a136e7d2ea2" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "79e4f7f1c801f322946a4da5d0aa8cd1f34f028742beb66b97023a136e7d2ea2" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_acl.lambda-layers must be replaced
-/+ resource "aws_s3_bucket_acl" "lambda-layers" {
      ~ bucket                = "gaspi-lambda-layers-20250725085312458800000001" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-lambda-layers-20250725085312458800000001,private" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "79e4f7f1c801f322946a4da5d0aa8cd1f34f028742beb66b97023a136e7d2ea2" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "79e4f7f1c801f322946a4da5d0aa8cd1f34f028742beb66b97023a136e7d2ea2" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_acl.metadata must be replaced
-/+ resource "aws_s3_bucket_acl" "metadata" {
      ~ bucket                = "gaspi-metadata-20250725085316769800000002" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-metadata-20250725085316769800000002,private" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "79e4f7f1c801f322946a4da5d0aa8cd1f34f028742beb66b97023a136e7d2ea2" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "79e4f7f1c801f322946a4da5d0aa8cd1f34f028742beb66b97023a136e7d2ea2" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_acl.variants_bucket_acl must be replaced
-/+ resource "aws_s3_bucket_acl" "variants_bucket_acl" {
      ~ bucket                = "gaspi-variants-20250725085320871900000004" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-variants-20250725085320871900000004,private" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "79e4f7f1c801f322946a4da5d0aa8cd1f34f028742beb66b97023a136e7d2ea2" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "79e4f7f1c801f322946a4da5d0aa8cd1f34f028742beb66b97023a136e7d2ea2" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_cors_configuration.dataportal-bucket must be replaced
-/+ resource "aws_s3_bucket_cors_configuration" "dataportal-bucket" {
      ~ bucket                = "gaspi-dataportal-20250725085318492000000003" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-dataportal-20250725085318492000000003" -> (known after apply)
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_cors_configuration.metadata-bucket must be replaced
-/+ resource "aws_s3_bucket_cors_configuration" "metadata-bucket" {
      ~ bucket                = "gaspi-metadata-20250725085316769800000002" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-metadata-20250725085316769800000002" -> (known after apply)
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.metadata_bucket_lifecycle must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "metadata_bucket_lifecycle" {
      ~ bucket                                 = "gaspi-metadata-20250725085316769800000002" -> (known after apply) # forces replacement
      + expected_bucket_owner                  = (known after apply)
      ~ id                                     = "gaspi-metadata-20250725085316769800000002" -> (known after apply)
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.staging_bucket_lifecycle must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "staging_bucket_lifecycle" {
      ~ bucket                                 = "gaspi-dataportal-20250725085318492000000003" -> (known after apply) # forces replacement
      + expected_bucket_owner                  = (known after apply)
      ~ id                                     = "gaspi-dataportal-20250725085318492000000003" -> (known after apply)
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.variants_bucket_lifecycle must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "variants_bucket_lifecycle" {
      ~ bucket                                 = "gaspi-variants-20250725085320871900000004" -> (known after apply) # forces replacement
      + expected_bucket_owner                  = (known after apply)
      ~ id                                     = "gaspi-variants-20250725085320871900000004" -> (known after apply)
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles must be replaced
-/+ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ bucket      = "gaspi-dataportal-20250725085318492000000003" -> (known after apply) # forces replacement
      ~ eventbridge = true -> false
      ~ id          = "gaspi-dataportal-20250725085318492000000003" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ lambda_function {
          ~ id                  = "tf-s3-lambda-20250725090730409000000007" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ lambda_function {
          ~ id                  = "tf-s3-lambda-20250725090730409000000008" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.dataportal_bucket_ownership_controls must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "dataportal_bucket_ownership_controls" {
      ~ bucket = "gaspi-dataportal-20250725085318492000000003" -> (known after apply) # forces replacement
      ~ id     = "gaspi-dataportal-20250725085318492000000003" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.lambda_layers_bucket_ownership_controls must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "lambda_layers_bucket_ownership_controls" {
      ~ bucket = "gaspi-lambda-layers-20250725085312458800000001" -> (known after apply) # forces replacement
      ~ id     = "gaspi-lambda-layers-20250725085312458800000001" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.metadata_bucket_ownership_controls must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "metadata_bucket_ownership_controls" {
      ~ bucket = "gaspi-metadata-20250725085316769800000002" -> (known after apply) # forces replacement
      ~ id     = "gaspi-metadata-20250725085316769800000002" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.variants_bucket_ownership_controls must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "variants_bucket_ownership_controls" {
      ~ bucket = "gaspi-variants-20250725085320871900000004" -> (known after apply) # forces replacement
      ~ id     = "gaspi-variants-20250725085320871900000004" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_versioning.dataportal-bucket must be replaced
-/+ resource "aws_s3_bucket_versioning" "dataportal-bucket" {
      ~ bucket                = "gaspi-dataportal-20250725085318492000000003" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-dataportal-20250725085318492000000003" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.sbeacon.aws_s3_bucket_versioning.metadata-bucket must be replaced
-/+ resource "aws_s3_bucket_versioning" "metadata-bucket" {
      ~ bucket                = "gaspi-metadata-20250725085316769800000002" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-metadata-20250725085316769800000002" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.sbeacon.aws_sagemaker_notebook_instance_lifecycle_configuration.sagemaker_jupyter_instance_lcc will be updated in-place
  ~ resource "aws_sagemaker_notebook_instance_lifecycle_configuration" "sagemaker_jupyter_instance_lcc" {
        id        = "clone-gaspi-notebooks"
        name      = "clone-gaspi-notebooks"
      ~ tags      = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all  = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.sbeacon.aws_secretsmanager_secret.dataportal_pii_encryption will be destroyed
  # (because aws_secretsmanager_secret.dataportal_pii_encryption is not in configuration)
  - resource "aws_secretsmanager_secret" "dataportal_pii_encryption" {
      - arn                            = "arn:aws:secretsmanager:ap-southeast-3:209479276142:secret:sbeacon-dataportal/pii-encryption-keys-cSVYkk" -> null
      - description                    = "PII encryption keys for data portal sensitive data" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ap-southeast-3:209479276142:secret:sbeacon-dataportal/pii-encryption-keys-cSVYkk" -> null
      - kms_key_id                     = "arn:aws:kms:ap-southeast-3:209479276142:key/5ed9009c-2b2e-45d6-a7ae-f7585461e626" -> null
      - name                           = "sbeacon-dataportal/pii-encryption-keys" -> null
      - recovery_window_in_days        = 30 -> null
      - region                         = "ap-southeast-3" -> null
      - tags                           = {
          - "Compliance"  = "HIPAA"
          - "Environment" = "STAGING"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "GXC"
          - "Purpose"     = "PII-Encryption"
        } -> null
      - tags_all                       = {
          - "Compliance"  = "HIPAA"
          - "Environment" = "STAGING"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "GXC"
          - "Purpose"     = "PII-Encryption"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.aws_secretsmanager_secret_version.dataportal_pii_encryption will be destroyed
  # (because aws_secretsmanager_secret_version.dataportal_pii_encryption is not in configuration)
  - resource "aws_secretsmanager_secret_version" "dataportal_pii_encryption" {
      - arn            = "arn:aws:secretsmanager:ap-southeast-3:209479276142:secret:sbeacon-dataportal/pii-encryption-keys-cSVYkk" -> null
      - id             = "arn:aws:secretsmanager:ap-southeast-3:209479276142:secret:sbeacon-dataportal/pii-encryption-keys-cSVYkk|terraform-20250902084851312400000002" -> null
      - region         = "ap-southeast-3" -> null
      - secret_id      = "arn:aws:secretsmanager:ap-southeast-3:209479276142:secret:sbeacon-dataportal/pii-encryption-keys-cSVYkk" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20250902084851312400000002" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.sbeacon.aws_sns_topic.performQuery will be updated in-place
  ~ resource "aws_sns_topic" "performQuery" {
        id                                       = "arn:aws:sns:ap-southeast-3:209479276142:performQuery"
        name                                     = "performQuery"
      ~ tags                                     = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (30 unchanged attributes hidden)
    }

  # module.sbeacon.aws_sns_topic.splitQuery will be updated in-place
  ~ resource "aws_sns_topic" "splitQuery" {
        id                                       = "arn:aws:sns:ap-southeast-3:209479276142:splitQuery"
        name                                     = "splitQuery"
      ~ tags                                     = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (30 unchanged attributes hidden)
    }

  # module.sbeacon.null_resource.init_script must be replaced
+/- resource "null_resource" "init_script" {
      ~ id       = "8229067861598192965" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "script_hash" = "add3abce0e64b5451bb594398e3d605db0bb3d85" -> "bbc03975f95f05b59dedd9be2e829038e1191f06"
        }
    }

  # module.sbeacon.random_bytes.pii_primary_k
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.